# Homework - SQL1

아래는 학생과 수업에 관련된 데이터베이스 테이블이다. 

![image.png](attachment:image.png)

In [ ]:
%load_ext sql

In [ ]:
!pip install pymysql

Requirement already satisfied: pymysql in /usr/local/lib/python3.6/dist-packages (0.10.1)

### Use your host, id, and password

In [ ]:
import getpass
user = 'ethan'
password = getpass.getpass()
host='ethandb.ckskfpkvntpc.us-east-1.rds.amazonaws.com'
database = ''
connection_string = f'mysql+pymysql://{user}:{password}@{host}:3306/{database}'
    
%sql $connection_string

··········

'Connected: ethan@'

### Create your univdb database and use it

In [ ]:
%%sql

DROP DATABASE IF EXISTS univdb;
CREATE DATABASE IF NOT EXISTS univdb;

 * mysql+pymysql://ethan:***@ethandb.ckskfpkvntpc.us-east-1.rds.amazonaws.com:3306/
5 rows affected.
1 rows affected.

[]

In [ ]:
%sql USE univdb;

 * mysql+pymysql://ethan:***@ethandb.ckskfpkvntpc.us-east-1.rds.amazonaws.com:3306/
0 rows affected.

[]

#### 1.  관계형 데이터베이스 테이블 스키마(create table)을 생성하고, MySQL DBMS를 이용하여 테이블을 생성하시오. 

- 테이블은 적절한 컬럼 데이터 타입, Primary Key, Foreign Key (on delete, on update rule 포함, restrict, set null, cascade), 필요하다면 Unique, NOT NULL 등이 표시되어야 한다. 

- 조건: 선수과목 정보는 course 정보 때문에 유지하는 정보이다. 즉, Course가 삭제되면, 불필요한 정보이다.
- 스키마 작성시 9번 문제가 성공할 수 있도록 스키마를 작성하여야 한다.

- Semester은 enum type을 사용하여, 봄, 여름, 가을, 겨울 순서가 되게 한다.
- Grade는 enum type을 사용하여 A, B, C, D, F 순서가 되게 한다.

In [ ]:
%sql show tables;

 * mysql+pymysql://ethan:***@ethandb.ckskfpkvntpc.us-east-1.rds.amazonaws.com:3306/
0 rows affected.

[]

In [ ]:
# %%sql
# drop table if exists PREREQUISITE;
# drop table if exists GRADE_REPORT;
# drop table if exists SECTION;
# drop table if exists COURSE;
# drop table if exists STUDENT;

In [ ]:
%%sql
-- YOUR CODE HERE 20

CREATE TABLE STUDENT(       
        Name VARCHAR(15) NOT NULL,
        Student_number CHAR(3) NOT NULL,
        Class INT,
        Major CHAR(5),
        PRIMARY KEY (Student_number)
) ENGINE=InnoDB;

CREATE TABLE COURSE(       
        Course_name VARCHAR(30) NOT NULL,
        Course_number CHAR(10) NOT NULL,
        Credit_hours INT,
        Department CHAR(5),
        PRIMARY KEY (Course_number)
) ENGINE=InnoDB;

CREATE TABLE SECTION(       
        Section_identifier CHAR(4) NOT NULL,
        Course_number CHAR(10) NOT NULL,
        Semester ENUM('Spring','Summer','Fall','Winter'),
        Year CHAR(3),
        Instructor CHAR(10) ,
        PRIMARY KEY (Section_identifier),
        FOREIGN KEY (Course_number) 
                REFERENCES COURSE(Course_number) 
                ON DELETE CASCADE
                ON UPDATE CASCADE
        
) ENGINE=InnoDB;

CREATE TABLE GRADE_REPORT(       
        Student_number CHAR(3) NOT NULL,        
        Section_identifier CHAR(4) NOT NULL,
        Grade ENUM('A','B','C','D','F'),
        PRIMARY KEY (Student_number, Section_identifier),
        FOREIGN KEY (Student_number) 
                REFERENCES STUDENT(Student_number) 
                ON DELETE CASCADE
                ON UPDATE CASCADE,
        FOREIGN KEY (Section_identifier) 
                REFERENCES SECTION(Section_identifier) 
                ON DELETE CASCADE
                ON UPDATE CASCADE
) ENGINE=InnoDB;

CREATE TABLE PREREQUISITE(       
        Course_number CHAR(10) NOT NULL,
        Prerequisite_number CHAR(10) NOT NULL,
        PRIMARY KEY (Course_number, Prerequisite_number),
        FOREIGN KEY (Course_number) 
                REFERENCES COURSE(Course_number) 
                ON DELETE CASCADE
                ON UPDATE CASCADE,
        FOREIGN KEY (Prerequisite_number) 
                REFERENCES COURSE(Course_number) 
                ON DELETE CASCADE
                ON UPDATE CASCADE
) ENGINE=InnoDB;

 * mysql+pymysql://ethan:***@ethandb.ckskfpkvntpc.us-east-1.rds.amazonaws.com:3306/
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.

[]

#### 2. 각 테이블에 위에 테이블에 주어진 행들을 “insert into”를 이용하여 행들을 삽입하시오. Select \* from <table_name>를 이용하여 삽입의 성공 여부를 확인하시오.

In [ ]:
%%sql
-- YOUR CODE HERE 10

insert into STUDENT values
        ("Smith", "17",1, "CS"),
        ("Brown", "8",2, "CS");

insert into COURSE values 
        ("Intro to Computer Science", "CS1310",4, "CS"),
        ("Data Structures", "CS3320",4, "CS"),
        ("Discrete Mathematics", "MATH2410",3, "MATH"),
        ("Database", "CS3380",3, "CS");

insert into SECTION values
        ("85", "MATH2410", 'Fall', '07', "King"),
        ("92", "CS1310", 'Fall', '07', "Anderson"),
        ("102", "CS3320", 'Spring', '08', "Kruth"),
        ("112", "MATH2410", 'Fall', '08', "Chang"),
        ("119", "CS1310", 'Fall', '08', "Anderson"),
        ("135", "CS3380", 'Fall', '08', "Stone");

insert into GRADE_REPORT values
        ("17", "112", "B"),
        ("17", "119", "C"),
        ("8", "85", "A"),
        ("8", "92", "A"),
        ("8", "102", "B"),
        ("8", "135", "A");

insert into PREREQUISITE values
        ("CS3380", "CS3320"),
        ("CS3380", "MATH2410"),
        ("CS3320", "CS1310");

 * mysql+pymysql://ethan:***@ethandb.ckskfpkvntpc.us-east-1.rds.amazonaws.com:3306/
2 rows affected.
4 rows affected.
6 rows affected.
6 rows affected.
3 rows affected.

[]

### Run the following cell to show that insert is correctly done

In [ ]:
%sql select * from STUDENT;

 * mysql+pymysql://ethan:***@ethandb.ckskfpkvntpc.us-east-1.rds.amazonaws.com:3306/
2 rows affected.

[('Smith', '17', 1, 'CS'), ('Brown', '8', 2, 'CS')]

In [ ]:
%sql select * from COURSE;

 * mysql+pymysql://ethan:***@ethandb.ckskfpkvntpc.us-east-1.rds.amazonaws.com:3306/
4 rows affected.

[('Intro to Computer Science', 'CS1310', 4, 'CS'),
 ('Data Structures', 'CS3320', 4, 'CS'),
 ('Database', 'CS3380', 3, 'CS'),
 ('Discrete Mathematics', 'MATH2410', 3, 'MATH')]

In [ ]:
%sql select * from SECTION;

 * mysql+pymysql://ethan:***@ethandb.ckskfpkvntpc.us-east-1.rds.amazonaws.com:3306/
6 rows affected.

[('102', 'CS3320', 'Spring', '08', 'Kruth'),
 ('112', 'MATH2410', 'Fall', '08', 'Chang'),
 ('119', 'CS1310', 'Fall', '08', 'Anderson'),
 ('135', 'CS3380', 'Fall', '08', 'Stone'),
 ('85', 'MATH2410', 'Fall', '07', 'King'),
 ('92', 'CS1310', 'Fall', '07', 'Anderson')]

In [ ]:
%sql select * from GRADE_REPORT;

 * mysql+pymysql://ethan:***@ethandb.ckskfpkvntpc.us-east-1.rds.amazonaws.com:3306/
6 rows affected.

[('17', '112', 'B'),
 ('17', '119', 'C'),
 ('8', '102', 'B'),
 ('8', '135', 'A'),
 ('8', '85', 'A'),
 ('8', '92', 'A')]

In [ ]:
%sql select * from PREREQUISITE;

 * mysql+pymysql://ethan:***@ethandb.ckskfpkvntpc.us-east-1.rds.amazonaws.com:3306/
3 rows affected.

[('CS3320', 'CS1310'), ('CS3380', 'CS3320'), ('CS3380', 'MATH2410')]

#3. Database 과목을 수강한 학생들의 이름을 나열하시오.

In [ ]:
%%sql
-- YOUR CODE HERE 10
select st.Name
from STUDENT st, SECTION se, GRADE_REPORT gr,COURSE co
where co.Course_name="Database" and co.Course_number=se.Course_number and se.Section_identifier=gr.Section_identifier and st.Student_number=gr.Student_number

 * mysql+pymysql://ethan:***@ethandb.ckskfpkvntpc.us-east-1.rds.amazonaws.com:3306/
1 rows affected.

[('Brown',)]

#### 4. Grade_report테이블에 <8, 112, NULL> 행을 삽입하시오. 동일한 과목(course)을 두 번 이상 수강한 학생의 이름을 찾으시오.

In [ ]:
%sql insert into GRADE_REPORT values (8, 112, NULL);

 * mysql+pymysql://ethan:***@ethandb.ckskfpkvntpc.us-east-1.rds.amazonaws.com:3306/
1 rows affected.

[]

In [ ]:
%%sql
-- YOUR CODE HERE 10

select DISTINCT st.Name
from STUDENT st, SECTION sec1, GRADE_REPORT gr1, SECTION sec2, GRADE_REPORT gr2
where gr1.section_identifier=sec1.section_identifier and gr2.section_identifier=sec2.section_identifier 
and sec1.course_number=sec2.course_number and gr1.section_identifier!=gr2.section_identifier
and st.Student_number=gr1.Student_number and st.Student_number=gr2.Student_number

 * mysql+pymysql://ethan:***@ethandb.ckskfpkvntpc.us-east-1.rds.amazonaws.com:3306/
1 rows affected.

[('Brown',)]

#### 5. Database 과목을 듣기 위해 (직접 또는 간접적으로: directly or indirectly) 미리 들어야 하는(prerequisite) 과목(Course_name)들을 모두 나열하시오. (Prerequisite는 Acyclic graph이고 path의 최대 길이는 3이라고 가정함. 길이 3: A-B-C-D)

In [ ]:
%%sql
--10
(
select preCo.Course_name
from PREREQUISITE pr, COURSE co, COURSE preCo
where co.Course_name="Database" and co.Course_number=pr.Course_number and pr.Prerequisite_number=preCo.Course_number
)
UNION
(
select prepreCo.Course_name
from PREREQUISITE pr, PREREQUISITE prepr, COURSE co, COURSE prepreCo
where co.Course_name="Database" and co.Course_number=pr.Course_number and pr.Prerequisite_number=prepr.Course_number and prepr.Prerequisite_number=prepreCo.Course_number
)
UNION(
select preprepreCo.Course_name
from PREREQUISITE pr, PREREQUISITE prepr, PREREQUISITE preprepr,COURSE co, COURSE preprepreCo
where co.Course_name="Database" and co.Course_number=pr.Course_number 
and pr.Prerequisite_number=prepr.Course_number 
and prepr.Prerequisite_number=preprepr.Course_number
and preprepr.Prerequisite_number=preprepreCo.Course_number
);

 * mysql+pymysql://ethan:***@ethandb.ckskfpkvntpc.us-east-1.rds.amazonaws.com:3306/
3 rows affected.

[('Data Structures',),
 ('Discrete Mathematics',),
 ('Intro to Computer Science',)]

#### 6. 전공으로 수강한 과목들만 나열하는 MAJOR_GRADE_REPORT테이블을 만드시오. 테이블을 생성하고, GRADE_REPORT 테이블에서 전공으로 수강한 경우에 해당하는 행들만 아래 테이블에 삽입하시오. 전공으로 수강하였다는 것은 학생의 전공(Major)과 COURSE의 개설 Department가 같으면 전공으로 수강한 과목이다.
   
    MAJOR_GRADE_REPORT(Student_number, Section_identifier, Grade)

In [ ]:
%%sql
CREATE TABLE MAJOR_GRADE_REPORT(      
        Student_number CHAR(3) NOT NULL,        
        Section_identifier CHAR(4) NOT NULL,
        Grade ENUM('A','B','C','D','F'),
        PRIMARY KEY (Student_number, Section_identifier),
        FOREIGN KEY (Student_number) 
                REFERENCES STUDENT(Student_number) 
                ON DELETE CASCADE
                ON UPDATE CASCADE,
        FOREIGN KEY (Section_identifier) 
                REFERENCES SECTION(Section_identifier) 
                ON DELETE CASCADE
                ON UPDATE CASCADE
) ENGINE=InnoDB;

 * mysql+pymysql://ethan:***@ethandb.ckskfpkvntpc.us-east-1.rds.amazonaws.com:3306/
0 rows affected.

[]

In [ ]:
%%sql
--10
insert into MAJOR_GRADE_REPORT
select gr.*
from STUDENT st, COURSE co, SECTION se, GRADE_REPORT gr
where gr.section_identifier=se.section_identifier and se.course_number=co.course_number and st.student_number=gr.student_number and st.major=co.department

 * mysql+pymysql://ethan:***@ethandb.ckskfpkvntpc.us-east-1.rds.amazonaws.com:3306/
4 rows affected.

[]

### Run the following cell to show that insert is correctly done

In [ ]:
%sql select * from MAJOR_GRADE_REPORT;

 * mysql+pymysql://ethan:***@ethandb.ckskfpkvntpc.us-east-1.rds.amazonaws.com:3306/
4 rows affected.

[('17', '119', 'C'), ('8', '102', 'B'), ('8', '135', 'A'), ('8', '92', 'A')]

In [ ]:
# %sql drop table if exists MAJOR_GRADE_REPORT;

#### 7. 모든 학생들의 성적들을 다음과 같이 출력하려 한다. 적절한 SQL문을 작성하여 실행하시오. 
- 결과 테이블은 Major, Student_number, Year, Semester, Course_number 순서로 정렬되어야 한다.
- 결과 테이블 애트리뷰트 이름 및 순서: (Major, Student_number, Student_name, Year, Semester, Course_number, Course_name, Grade)

In [ ]:
%%sql
-- YOUR CODE HERE 0
select st.Major, st.Student_number, se.Year, se.Semester, se.Course_number
from GRADE_REPORT gr, STUDENT st, SECTION se
where se.Section_identifier=gr.Section_identifier and st.Student_number=gr.Student_number

 * mysql+pymysql://ethan:***@ethandb.ckskfpkvntpc.us-east-1.rds.amazonaws.com:3306/
7 rows affected.

[('CS', '17', '08', 'Fall', 'MATH2410'),
 ('CS', '17', '08', 'Fall', 'CS1310'),
 ('CS', '8', '08', 'Spring', 'CS3320'),
 ('CS', '8', '08', 'Fall', 'MATH2410'),
 ('CS', '8', '08', 'Fall', 'CS3380'),
 ('CS', '8', '07', 'Fall', 'MATH2410'),
 ('CS', '8', '07', 'Fall', 'CS1310')]

#### 8. Brown이 수강한 Database 과목의 학점을 F로 수정하시오.

In [ ]:
%%sql
-- YOUR CODE HERE 10
update GRADE_REPORT
set grade='F'
where Section_identifier in (
    select se.Section_identifier
    from COURSE co, SECTION se
    where co.course_name="Database" and co.course_number=se.course_number
    )
and Student_number in(
    select st.student_number
    from STUDENT st
    where st.name="Brown"
)

 * mysql+pymysql://ethan:***@ethandb.ckskfpkvntpc.us-east-1.rds.amazonaws.com:3306/
1 rows affected.

[]

### Run the following cell to show that update is correctly done

In [ ]:
%sql select * from GRADE_REPORT where Student_number = 8 and Section_identifier = 135;

 * mysql+pymysql://ethan:***@ethandb.ckskfpkvntpc.us-east-1.rds.amazonaws.com:3306/
1 rows affected.

[('8', '135', 'F')]

#### 9. Brown의 학번을 8번에서 9번으로 수정하시오. 반드시 update문 하나만 있어야 하며, update 문은 반드시 성공하여야 한다. 테이블의 Foreign Key 선언문을 삭제하면 안됨.

In [ ]:
%%sql
-- YOUR CODE HERE 10
update STUDENT
set student_number=9
where name="Brown"

 * mysql+pymysql://ethan:***@ethandb.ckskfpkvntpc.us-east-1.rds.amazonaws.com:3306/
1 rows affected.

[]

In [ ]:
# %%sql
# -- YOUR CODE HERE
# update STUDENT
# set student_number=8
# where name="Brown"

### Run the following cell to show that update is correctly done

In [ ]:
%sql select * from STUDENT where name = 'Brown';

 * mysql+pymysql://ethan:***@ethandb.ckskfpkvntpc.us-east-1.rds.amazonaws.com:3306/
1 rows affected.

[('Brown', '9', 2, 'CS')]

In [ ]:
%sql select * from GRADE_REPORT;

 * mysql+pymysql://ethan:***@ethandb.ckskfpkvntpc.us-east-1.rds.amazonaws.com:3306/
7 rows affected.

[('17', '112', 'B'),
 ('17', '119', 'C'),
 ('9', '102', 'B'),
 ('9', '112', None),
 ('9', '135', 'F'),
 ('9', '85', 'A'),
 ('9', '92', 'A')]